Revit 2027 API
BuiltInFailures.EditingFailures.CannotScaleInView Property
 Can't scale because Move Plane is at a very sharp angle in this view. Change view angle or go to another view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotScaleInView { get; }
Public Shared ReadOnly Property CannotScaleInView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotScaleInView {
	FailureDefinitionId^ get ();
}
static member CannotScaleInView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace